slides/2013-04-26-Midterm-HW.org
* Homework: Midterm Corrections :slide:
  + Midterm should not be cram-and-forget
  + Correct the mistakes on your midterms
  + Ask questions for problems you don't understand

* Deliverable :slide:
  + GitHub pull request:
  + Question # : Correct answer
  + Open book, notes, everything. Cite sources
  + Have slightly more exposition than the midterm requires
** Exposition :notes:
   + Eg. if the midterm asks 2 sentences, maybe write 3-4
   + If midterm asks for psudo code, consider writing Python (though syntax will
     not be graded)

* Why? :slide:
  + These questions frequently come up on interviews, conversation.
  + "How can you describe a distribution?"
  + "Write out a MapReduce job to calculate click through rates."
  + "How can we tell if a review is duplicated?"

#+STYLE: <link rel="stylesheet" type="text/css" href="production/common.css" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/screen.css" media="screen" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/projection.css" media="projection" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/color-blue.css" media="projection" />
#+STYLE: <link rel="stylesheet" type="text/css" href="production/presenter.css" media="presenter" />
#+STYLE: <link href='http://fonts.googleapis.com/css?family=Lobster+Two:700|Yanone+Kaffeesatz:700|Open+Sans' rel='stylesheet' type='text/css'>

#+BEGIN_HTML
<script type="text/javascript" src="production/org-html-slideshow.js"></script>
#+END_HTML

# Local Variables:
# org-export-html-style-include-default: nil
# org-export-html-style-include-scripts: nil
# buffer-file-coding-system: utf-8-unix
# End:
